Catalogs/КонтактЦентры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>КонтактЦентры</Name>
			<Comment>Контакт-центры</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Очередь</Name>
					<Comment>Очередь контакт-центра. Используется для определения состояния паузы телефона (в очереди)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелОчереди</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>Подразделение к которому относится контакт-центр</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяКаскадОчередей</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПочтовыеФильтры</Name>
					<Comment>Правила, в соответствии с которыми входящие почтовые сообщения помещаются в список контроля для данного контакт-центра</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Comment>Почтовый адрес или имя сервера отправителя</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Назначение</Name>
							<Comment>Принадлежность адреса к подразделению</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Подразделения</Name>
					<Comment>Доступные подразделения</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Comment>Доступ к иерархии подразделения</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Предприятие</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Пользователи</Name>
					<Comment>Список пользователей - сотрудников контакт-центра</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Comment>Пользователь - сотрудник контакт-центра</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПанельСостав</Name>
					<Comment>Состав панели быстрого вызова</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Comment>Подпись к кнопке быстрого вызова</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Телефон</Name>
							<Comment>Телефон или очередь для быстрого вызова</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ТелОчереди</v8:Type>
								<v8:Type>cfg:CatalogRef.ТелВнутренние</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КаскадОчередей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Очередь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТелОчереди</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбрабатыватьАвтозвонок</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/КонтактЦентры/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ,СтандартнаяОбработка)

// Линейный элемент справочника не может находиться вне группы
//-------------------------------------------------------------------------------------------------
	Если (НЕ ЗначениеЗаполнено(Объект.Родитель)) Тогда
		ТекстСообщения = "Панель быстрого вызова должена принадлежать контакт-центру";
		Сообщить(ТекстСообщения);
		Отказ = Истина;
	КонецЕсли;

// Сформируем заголовок формы
//-------------------------------------------------------------------------------------------------
	Темп = "Панель для """ + СокрЛП(Объект.Родитель) + """";
	ЭтаФорма.Заголовок = СокрЛП(Темп);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение,ИсточникВыбора)

// В зависимости от типа выбранного значения
//-------------------------------------------------------------------------------------------------
	Если (ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.ТелОчереди")) Тогда
		СоставДобавитьНаСервере(ВыбранноеЗначение);
	ИначеЕсли (ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.ТелВнутренние")) Тогда
		СоставДобавитьНаСервере(ВыбранноеЗначение);
	КонецЕсли;
КонецПроцедуры

//-------------------------------------------------------------------------------------------------

&НаКлиенте
Процедура СоставДобавить(Команда)

// В зависимости от типа добавляемого элемента откроем форму выбора
//-------------------------------------------------------------------------------------------------
	СтрПараметры = Новый Структура("ЗакрыватьПриВыборе",Ложь);
	ФормаИмя = ?(Команда.Имя = "СоставДобавитьОчередь","ТелОчереди","ТелВнутренние");
	ФормаВыбора = ПолучитьФорму("Справочник." + ФормаИмя + ".ФормаВыбора",СтрПараметры,ЭтаФорма);
	ФормаВыбора.Открыть();
КонецПроцедуры

&НаСервере
Процедура СоставДобавитьНаСервере(ТелСсылка)

// Найдем переданную ссылку (внутренний телефон или системную очередь) в табличной части
//-------------------------------------------------------------------------------------------------
	Доступно = (ТипЗнч(ТелСсылка) = Тип("СправочникСсылка.ТелВнутренние"));
	Доступно = Доступно ИЛИ (ТипЗнч(ТелСсылка) = Тип("СправочникСсылка.ТелОчереди"));
	Доступно = Доступно И ЗначениеЗаполнено(ТелСсылка);

	Если (Доступно = Истина) Тогда
		СтрПараметры = Новый Структура("Телефон",ТелСсылка);
		НайденныеСтроки = Объект.ПанельСостав.НайтиСтроки(СтрПараметры);

		Если (НайденныеСтроки.Количество() = 0) Тогда
			НовСтрока = Объект.ПанельСостав.Добавить();
			НовСтрока.Телефон = ТелСсылка;

// Сформируем реквизит "Наименование" для добавленной строки
//-------------------------------------------------------------------------------------------------
			ВладСсылка = Телефония.ВладелецПолучить(ТелСсылка);
			НовСтрока.Наименование = СокрЛП(ВладСсылка);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоставПередНачаломДобавления(Элемент,Отказ,Копирование,Родитель,Группа,Параметр)
	СоставДобавить(ЭтаФорма.Команды["СоставДобавитьТелефон"]);
	Отказ = Истина;
КонецПроцедуры
